app/controllers/urls_controller.rb

SELECT "urls".* FROM "urls"
SELECT "urls".* FROM "urls" LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
---
  def index
    # searchUrl is used to search the url in the database.
    if params[:s].present?
      @searchUrl = Url.where("name LIKE ?", "%" + params[:s] + "%")
      if @searchUrl.present?
        render json: @searchUrl, status: :ok
      else
        render json: {message: "No record found"}
      end
    else
      urls = Url.paginate(page: params[:page], per_page: 3)

DELETE FROM "urls" WHERE "urls"."id" = $1  [["id", 2]]
---
  def destroy
    if @url
      @url.destroy

SELECT "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def search_url
    #Url.find_by use for find the id of the url and display it in the show
    @url = Url.find_by(id: params[:id])
    if @url.blank?

SELECT "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_url
    @url = Url.find_by(id: params[:id])